{
  "publications":[
    {
      "title": "Towards ab initio extremely metal-poor stars",
      "authors": "Ritter, Jeremy S.; Safranek-Shrader, Chalence; Milosavljevic, Milos; Bromm, Volker",
      "abstract": "Extremely metal-poor stars have been the focus of much recent attention owing to the expectation that their chemical abundances can shed light on the metal and dust yields of the earliest supernovae. We present our most realistic simulation to date of the astrophysical pathway to the first metal-enriched stars. We simulate the radiative and supernova hydrodynamic feedback of a 60 M_sun Population III star starting from cosmological initial conditions realizing Gaussian density fluctuations. We follow the gravitational hydrodynamics of the supernova remnant at high spatial resolution through its freely expanding, adiabatic, and radiative phases, until gas, now metal-enriched, has resumed runaway gravitational collapse. Our findings are surprising: while the Population III progenitor exploded with a low energy of 10^51 erg and injected an ample metal mass of 6 M_sun, the first cloud to collapse after the supernova explosion is a dense surviving primordial cloud on which the supernova blast wave deposited metals only superficially, in a thin, unresolved layer. The first metal-enriched stars can form at a very low metallicity, of only 2-5 x 10^-4 Z_sun, and can inherit the parent cloud's highly elliptical, radially extended orbit in the dark matter gravitational potential.",
      "url": "http://adsabs.harvard.edu/abs/2016MNRAS.463.3354R",
      "reference": "2016MNRAS.463.3354R"
    },
    {
      "title": "Metal transport and chemical heterogeneity in early star forming systems",
      "authors": "Ritter, Jeremy S.; Sluder, Alan; Safranek-Shrader, Chalence; Milosavljevic, Milos; Bromm, Volker",
      "abstract": "To constrain the properties of the first stars with the chemical abundance patterns observed in metal-poor stars, one must identify any non-trivial effects that the hydrodynamics of metal dispersal can imprint on the abundances. We use realistic cosmological hydrodynamic simulations to quantify the distribution of metals resulting from one Population III supernova and from a small number of such supernovae exploding in close succession. Overall, supernova ejecta are highly inhomogeneously dispersed throughout the simulations. When the supernova bubbles collapse, quasi-virialized metal-enriched clouds, fed by fallback from the bubbles and by streaming of metal-free gas from the cosmic web, grow in the centres of the dark matter haloes. Partial turbulent homogenization on scales resolved in the simulation is observed only in the densest clouds where the vortical time-scales are short enough to ensure true homogenization on subgrid scales. However, the abundances in the clouds differ from the gross yields of the supernovae. Continuing the simulations until the cloud have gone into gravitational collapse, we predict that the abundances in second-generation stars will be deficient in the innermost mass shells of the supernova (if only one has exploded) or in the ejecta of the latest supernovae (when multiple have exploded). This indicates that hydrodynamics gives rise to biases complicating the identification of nucleosynthetic sources in the chemical abundance spaces of the surviving stars.",
      "url": "http://adsabs.harvard.edu/abs/2015MNRAS.451.1190R",
      "reference": "2015MNRAS.451.1190R"
    },
    {
      "title": "Abundance anomalies in metal-poor stars from Population III supernova ejecta hydrodynamics",
      "authors": "Sluder, Alan; Ritter, Jeremy; Safranek-Shrader, Chalence; Milosavljevic, Milos; Bromm, Volker",
      "abstract": "We present a simulation of the long-term evolution of a Population III supernova remnant in a cosmological minihalo. Employing passive Lagrangian tracer particles, we investigate how chemical stratification and anisotropy in the explosion can affect the abundances of the first low-mass, metal-enriched stars. We find that reverse shock heating can leave the inner mass shells at entropies too high to cool, leading to carbon-enhancement in the re-collapsing gas. This hydrodynamic selection effect could explain the observed incidence of carbon-enhanced metal-poor (CEMP) stars at low metallicity. We further explore how anisotropic ejecta distributions, recently seen in direct numerical simulations of core-collapse explosions, may translate to abundances in metal-poor stars. We find that some of the observed scatter in the Population II abundance ratios can be explained by an incomplete mixing of supernova ejecta, even in the case of only one contributing enrichment event. We demonstrate that the customary hypothesis of fully-mixed ejecta clearly fails if post-explosion hydrodynamics prefers the recycling of some nucleosynthetic products over others. Furthermore, to fully exploit the stellar-archaeological program of constraining the Pop III initial mass function from the observed Pop II abundances, considering these hydrodynamical transport effects is crucial. We discuss applications to the rich chemical structure of ultra-faint dwarf satellite galaxies, to be probed in unprecedented detail with upcoming spectroscopic surveys.",
      "url": "http://adsabs.harvard.edu/abs/2015arXiv150507126S",
      "reference": "2015arXiv150507126S"
    },
    {
      "title": "Confined Population III Enrichment and the Prospects for Prompt Second-generation Star Formation",
      "authors": "Ritter, Jeremy S.; Safranek-Shrader, Chalence; Gnat, Orly; Milosavljevic, Milos; Bromm, Volker",
      "abstract": "It is widely recognized that nucleosynthetic output of the first Population III supernovae was a catalyst defining the character of subsequent stellar generations. Most of the work on the earliest enrichment was carried out assuming that the first stars were extremely massive and that the associated supernovae were unusually energetic, enough to completely unbind the baryons in the host cosmic minihalo and disperse the synthesized metals into the intergalactic medium. Recent work, however, suggests that the first stars may in fact have been somewhat less massive, with a characteristic mass scale of a few tens of solar masses. We present a cosmological simulation following the transport of the metals synthesized in a Population III supernova assuming that it had an energy of 1051 erg, compatible with standard Type II supernovae. A young supernova remnant is inserted in the first star's relic H II region in the free expansion phase and is followed for 40 Myr employing adaptive mesh refinement and Lagrangian tracer particle techniques. The supernova remnant remains partially trapped within the minihalo, and the thin snowplow shell develops pronounced instability and fingering. Roughly half of the ejecta turn around and fall back toward the center of the halo, with 1% of the ejecta reaching the center in ~30 kyr and 10% in ~10 Myr. The average metallicity of the combined returning ejecta and the pristine filaments feeding into the halo center from the cosmic web is ~0.001-0.01 Z_sun, but the two remain unmixed until accreting onto the central hydrostatic core that is unresolved at the end of the simulation. We conclude that if Population III stars had less extreme masses, they promptly enriched the host minihalos with metals and triggered Population II star formation.",
      "url": "http://adsabs.harvard.edu/abs/2012ApJ...761...56R",
      "reference": "2012ApJ...761...56R"
    }
  ]
}
